
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивСубконтоПДР") Тогда
		МассивСубконтоПДР = Параметры.МассивСубконтоПДР;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(МассивСубконтоПДР);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	ЗаполнитьПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	Запрос = Новый Запрос;
	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницы);
	МассивВидов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
	МассивВидов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучениюУплате);

	Запрос.УстановитьПараметр("МассивВидов", МассивВидов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов В(&МассивВидов)";
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивСубконтоПДР.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры
