#Область ОбработчикиСобытийФормы
	
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	ОчиститьСообщения();
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
		
		ТабличныйДокумент = РеквизитФормыВЗначение("Отчет").СформироватьОтчет(Организация, Период);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
